
## Plan Result (system_a)

[CI link](https://github.com/nangashi/dcr/actions/runs/7519463391)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * aws_cloudwatch_metric_alarm.lambda_alarm
* Update
  * module.monthly_aggregate.aws_lambda_function.this[0]
* Replace
  * module.requirements_layer.aws_lambda_layer_version.layer


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_cloudwatch_metric_alarm.lambda_alarm will be created
  + resource "aws_cloudwatch_metric_alarm" "lambda_alarm" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ap-northeast-1:384081048358:SlackNotification-prd",
        ]
      + alarm_description                     = "Errors alarm for the lambda function"
      + alarm_name                            = "lambda-errors-alarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "FunctionName" = "MonthlyAggregate-prd"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Errors"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:ap-northeast-1:384081048358:SlackNotification-prd",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
        }
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # module.monthly_aggregate.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "MonthlyAggregate-prd"
      ~ layers                         = [
          - "arn:aws:lambda:ap-northeast-1:384081048358:layer:system_a_layer-prd:3",
          - "arn:aws:lambda:ap-northeast-1:384081048358:layer:common_layer-prd:1",
        ] -> (known after apply)
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.requirements_layer.aws_lambda_layer_version.layer must be replaced
-/+ resource "aws_lambda_layer_version" "layer" {
      ~ arn                         = "arn:aws:lambda:ap-northeast-1:384081048358:layer:system_a_layer-prd:3" -> (known after apply)
      ~ compatible_architectures    = [ # forces replacement
          + "x86_64",
        ]
      ~ created_date                = "2024-01-08T13:42:48.440+0000" -> (known after apply)
      ~ filename                    = "./lambda/layer/layer.zip" -> "/tmp/tmp.8t52f4ZmA4/layer.zip"
      ~ id                          = "arn:aws:lambda:ap-northeast-1:384081048358:layer:system_a_layer-prd:3" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-northeast-1:384081048358:layer:system_a_layer-prd" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "oG9Vl/Pke5uXrsB0kvT9+fD04cgO5gMJrzD4R5DgHJg=" -> "gSn4NpmorriKqkxbN1nbj+dkOwgiyzxISexleDtKoxI=" # forces replacement
      ~ source_code_size            = 19163985 -> (known after apply)
      ~ version                     = "3" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":42,"Program":"tfcmt","SHA1":"893d737cfe9b8317f945dfa3616c9864a1d5f9e4","Target":"system_a","Vars":{},"WorkflowName":"Check Pull Requests"} -->